---
kind: other
id: Methods.T:Autodesk.Revit.DB.RuledSurface
source: html/9d657e8f-2a6e-5fea-aa4d-720f9a8e654d.htm
---
# RuledSurface Methods

Creates a Surface object coincident with the ruled surface joining two bounded generating curves.